





////{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
//	// Данный фрагмент построен конструктором.
//	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ЦеныТоваров.Период КАК Период,
//		|	ЦеныТоваров.Регистратор КАК Регистратор,
//		|	ЦеныТоваров.НомерСтроки КАК НомерСтроки,
//		|	ЦеныТоваров.Активность КАК Активность,
//		|	ЦеныТоваров.Товар КАК Товар,
//		|	ЦеныТоваров.ТипЦены КАК ТипЦены,
//		|	ЦеныТоваров.Цена КАК Цена
//		|ИЗ
//		|	РегистрСведений.ЦеныТоваров КАК ЦеныТоваров";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		
//	КонецЦикла;
//	
//	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
