&НаСервере
Процедура ПечатьНаСервереММ(ТабДок, Объект1) Экспорт
	Контрагент = Объект1.Контрагент;
	НомерДокумента = Объект1.Номер;
	ДатаФормирования = Объект1.Дата;
	
	Макет = Документы.РасходнаяНакладная.ПолучитьМакет("Макет");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы.Параметры.Дата = Формат(ДатаФормирования, "ДЛФ==DD");
	ОбластьШапкаТаблицы.Параметры.Номер = НомерДокумента;
	ОбластьШапкаТаблицы.Параметры.Контрагент = Контрагент;
	Табдок.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьЗаголовки = Макет.ПолучитьОбласть("Заголовки");
	Табдок.Вывести(ОбластьЗаголовки);
	
	
	Итого = 0;
	Для Каждого Строка из Объект1.Товары Цикл
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрокаТаблицы.Параметры.Заполнить(Строка);
		ОбластьСтрокаТаблицы.Параметры.НомерПП = Строка.НомерСтроки;
		ТабДок.Вывести(ОбластьСтрокаТаблицы);
		Итого = Итого + Строка.Сумма;
	КонецЦикла;
	
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвалТаблицы.Параметры.Итого = Итого;
	Табдок.Вывести(ОбластьПодвалТаблицы);

 КонецПроцедуры