
&НаКлиенте
Процедура Печать(Команда)
	ТабДок = Новый ТабличныйДокумент;
	
	Массив = Элементы.Список.ВыделенныеСтроки;
	Для Каждого Объект Из Массив Цикл
		

	ПечатьНаСервере3(ТабДок,Объект);
	КонецЦикла;
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры



&НаСервере
Процедура ПечатьНаСервере3(ТабДок, Объект)
	Документы.РасходнаяНакладная.ПечатьНаСервереММ(ТабДок,Объект);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры	
   
    
