&НаСервере
Процедура ПечатьНаСервереММ(ТабДок, Объект1) Экспорт
	ТипЦены = Объект1.ТипЦены;
	ДатаФормирования = Объект1.Дата;
	
	Макет = Документы.УстановкаЦен.ПолучитьМакет("Макет");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы.Параметры.Дата = Формат(ДатаФормирования, "ДЛФ==DD");
	ОбластьШапкаТаблицы.Параметры.ТипЦены = ТипЦены;
	Табдок.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьЗаголовки = Макет.ПолучитьОбласть("Заголовки");
	Табдок.Вывести(ОбластьЗаголовки);
	
	Для Каждого Строка из Объект1.ТоварИЦена Цикл
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрокаТаблицы.Параметры.Заполнить(Строка);
		ОбластьСтрокаТаблицы.Параметры.НомерПП = Строка.НомерСтроки;
		ТабДок.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла;
 КонецПроцедуры