&НаКлиенте
Процедура Печать(Команда)
	ПечатьНаСервере().Показать();           
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
    ТабДок = Новый ТабличныйДокумент;
    ТабДок.ТолькоПросмотр = Истина;
    ТабДок.АвтоМасштаб = Истина;
    ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
   
	ДатаФормирования = Отчет.ДатаФормирования;
	КонкрТовар = Товар.Наименование;
	
	
	//ДатаОтчета = ?(ЗначениеЗаполнено(ДатаФормирования), ДатаФормирования, ТекущаяДата());
	ДатаОтчета = ДатаФормирования;
	
	Объект1 = РеквизитФормыВЗначение("Отчет");
	Макет = Объект1.ПолучитьМакет("Макет");

       
    ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы.Параметры.ДатаФормирования = Формат(ДатаОтчета, "ДЛФ==DD");
	ОбластьШапкаТаблицы.Параметры.Товар = КонкрТовар;
   
    ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
   
    Табдок.Вывести(ОбластьШапкаТаблицы);
   
    Запрос = Новый Запрос;
		
	Запрос.Текст =
        "ВЫБРАТЬ
		| ЦеныТоваров.Период,
		| ЦеныТоваров.Товар,
        | ЦеныТоваров.Цена
        |ИЗ
        | РегистрСведений.ЦеныТоваров КАК ЦеныТоваров
		|ГДЕ
		| ЦеныТоваров.Период = &ДатаФормирования И ЦеныТоваров.Товар = &Товар";
		
	Запрос.УстановитьПараметр("ДатаФормирования", ДатаОтчета);
	Запрос.УстановитьПараметр("Товар", Товар);

    РезультатЗапроса = Запрос.Выполнить();   
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
   
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        ОбластьСтрокаТаблицы.Параметры.Товар = ВыборкаДетальныеЗаписи.Товар;
        ОбластьСтрокаТаблицы.Параметры.Цена = ВыборкаДетальныеЗаписи.Цена;
        ТабДок.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла; 
    Возврат ТабДок;
КонецФункции
