&НаСервере 
Функция ПолучитьЦену(СсылкаНаОбъект)
    Запрос = Новый Запрос;
     Запрос.Текст =
      "ВЫБРАТЬ
		|	ЦеныТоваров.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныТоваров КАК ЦеныТоваров
		|ГДЕ 
		|	ЦеныТоваров.Товар.Наименование = &Товар";
     
     Запрос.УстановитьПараметр("Товар", СсылкаНаОбъект);
    ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

    Если ВыборкаДетальныеЗаписи.Следующий() Тогда
     Возврат  ВыборкаДетальныеЗаписи.Цена;     
Иначе
    Возврат 0;
КонецЕсли;
      
КонецФункции

&НаСервере
Процедура ЗаписьJSON() Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл("C:\xampp\htdocs\avtorazborka\1c\test.json");
	ВыборкаГорода = Справочники.Товары.Выбрать();
	
	ЗаписьJSON.ЗаписатьНачалоМассива();	
                   Пока ВыборкаГорода.Следующий() Цикл
                      //ЗаписьJSON.ЗаписатьЗначение(Строка("Товары"));
                      ВыборкаКатегории = Справочники.Товары.Выбрать();
                          ЗаписьJSON.ЗаписатьНачалоОбъекта();
                          ЗаписьJSON.ЗаписатьИмяСвойства("name");
                          ЗаписьJSON.ЗаписатьЗначение(Строка( ВыборкаГорода.Наименование));
                          ЗаписьJSON.ЗаписатьИмяСвойства("opisanie");
                          ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаГорода.Описание));
						  ЗаписьJSON.ЗаписатьИмяСвойства("artikul");
                          ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаГорода.Артикул));
						  ЗаписьJSON.ЗаписатьИмяСвойства("marka");
                          ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаГорода.Марка));
						  ЗаписьJSON.ЗаписатьИмяСвойства("model");
                          ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаГорода.Модель));
						  ЗаписьJSON.ЗаписатьИмяСвойства("path");
                          ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаГорода.Путь));
						  ЗаписьJSON.ЗаписатьИмяСвойства("price");
                          ЗаписьJSON.ЗаписатьЗначение(Строка(ПолучитьЦену(ВыборкаГорода.ПолучитьОбъект().Наименование)));
						  Сообщить(ПолучитьЦену(ВыборкаГорода.ПолучитьОбъект().Наименование));
                          ЗаписьJSON.ЗаписатьКонецОбъекта();
				  КонецЦикла;
	ЗаписьJSON.ЗаписатьКонецМассива();
	СериализованнаяСтрока = ЗаписьJSON.Закрыть();
	
КонецПроцедуры

